#### Terraform Plan Output 

```
data.archive_file.lambda: Reading...
data.archive_file.lambda: Read complete after 0s [id=32126f52a741a4426dcd4baa081ef4c0a007f633]
aws_iam_role.scanner: Refreshing state... [id=S3ScannerRole]
aws_s3_bucket.secure_bucket: Refreshing state... [id=cyb611-secure-phish-bits-12345]
data.aws_caller_identity.current: Reading...
aws_s3_bucket.trail_bucket: Refreshing state... [id=cyb611-cloudtrail-logs-phish-bits-12345]
aws_s3_bucket.public_s3_rw_access: Refreshing state... [id=cyb611-phish-bits-insecure-ea-s3-public-write]
aws_s3_bucket.log_bucket: Refreshing state... [id=cyb611-access-logs-phish-bits-12345]
data.aws_caller_identity.current: Read complete after 0s [id=151462990345]
aws_s3_bucket_public_access_block.public_rw_disable: Refreshing state... [id=cyb611-phish-bits-insecure-ea-s3-public-write]
aws_s3_bucket_policy.trail_bucket_policy: Refreshing state... [id=cyb611-cloudtrail-logs-phish-bits-12345]
aws_cloudtrail.main_trail: Refreshing state... [id=arn:aws:cloudtrail:us-east-2:151462990345:trail/cyb611-management-events-trail]
aws_iam_role_policy.scanner: Refreshing state... [id=S3ScannerRole:S3ScannerPolicy]
aws_s3_bucket_policy.public_rw_policy: Refreshing state... [id=cyb611-phish-bits-insecure-ea-s3-public-write]
aws_lambda_function.scanner: Refreshing state... [id=S3SecurityScanner]
aws_s3_bucket_ownership_controls.log_ownership: Refreshing state... [id=cyb611-access-logs-phish-bits-12345]
aws_s3_bucket_policy.enforce_tls: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket_ownership_controls.ownership: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket_public_access_block.block: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket_versioning.versioning: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket_logging.example: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket_server_side_encryption_configuration.encryption: Refreshing state... [id=cyb611-secure-phish-bits-12345]
aws_s3_bucket_acl.log_acl: Refreshing state... [id=cyb611-access-logs-phish-bits-12345,log-delivery-write]
aws_lambda_function_url.scanner: Refreshing state... [id=S3SecurityScanner]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_s3_bucket.insecure will be created
  + resource "aws_s3_bucket" "insecure" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "cyb611-secure-phish-bits-insecure-bucket-1"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "Test"
          + "Name"        = "CYB611 InSecure"
        }
      + tags_all                    = {
          + "Environment" = "Test"
          + "Name"        = "CYB611 InSecure"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_policy.insecure will be created
  + resource "aws_s3_bucket_policy" "insecure" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.insecure will be created
  + resource "aws_s3_bucket_public_access_block" "insecure" {
      + block_public_acls       = false
      + block_public_policy     = false
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = false
      + restrict_public_buckets = false
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```